tutorials/incompressible/vsfIcoFoam/TaylorGreenRe400/system/vsfDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      vsfDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nCorrectors     5;

ratioTimestep   1;

epsPre          [0 2 -1 0 0 0 0] 0.0;

epsCor          [0 2 -1 0 0 0 0] 0.0;

// ************************************************************************* //
